app/controllers/posts_controller.rb

  def create
    post      = Post.new(params[:post])
    post.user = current_user
    if post.save
---
INSERT INTO `posts` (`created_at`, `message`, `name`, `title`, `updated_at`) VALUES ('2012-12-16 21:52:52', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.', 'Nikhil', 'First Post', '2012-12-16 21:52:52')

  def update
    post = existing_post
    if post.update_attributes(params[:post])
---
UPDATE `posts` SET `name` = 'qewfd', `message` = 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.', `updated_at` = '2012-12-18 20:57:04' WHERE `posts`.`id` = 10

  def destroy
    post = existing_post
    post.destroy
---
DELETE FROM `posts` WHERE `posts`.`id` = 1