app/controllers/sessions_controller.rb

INSERT INTO `users` (`created_at`, `name`, `oauth_expires_at`, `oauth_token`, `provider`, `uid`, `updated_at`) VALUES ('2012-12-23 23:28:19', 'Bob Example', NULL, NULL, 'twitter', '128508055', '2012-12-23 23:28:19')
SELECT `users`.* FROM `users` WHERE `users`.`provider` = 'twitter' AND `users`.`uid` = '128508055' LIMIT 1
---
  def create
    auth              = request.env["omniauth.auth"]
    user              = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_from_omniauth(auth)